[
    {
        "speaker_id": "Guest-1",
        "transcription": "Ya, so, uh, we just start talking right? OK, so umm, we should we start with maybe the first one or Oh no, what do you do in JB yesterday?"
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "Yesterday ah wah, that's a very jam. We we awake at the count the the checkpoint more than 1 1/2 hour in Malaysia when we reach after the checkpoint already 12."
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "No time to take breakfast already. Just proceed to KSL that's all. What's what is KSLKSL is a mole lah in in JB. What time did you leave house? It's about 7:00."
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "About 7, about 7:00 in the morning, ya, and then you reached a Kranji MRT reach Kranji MRT about 838 thirty, ya, very packed already. That's like, MMM. Then we took a bus, OK, 'cause every Saturday when I'm there, then there's like a very long queue for the train, for the buses into Malaysia."
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "You want to have a coffee? Coffee. Then daddy say uh, OK at the checkpoint have a jam, so maybe."
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "Tomorrow that that means today lah. Today he will meet Uncle Kwek Lah in Malaysia or in Singapore."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "Oh, wait. Huh. So uncle, Uncle Kwek wanted to meet for breakfast yesterday?"
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "OK."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "Then So what time did you reach Malaysia from Kranji MRT?"
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "10:30."
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "OK, about 10:30 we reached the checkpoint 1 and half hour 12 LOR. Then we then we can pass the checkpoint. The immigration is horrible. So what bus did you take into Malaysia? Into Malaysia, What bus we take?"
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "170."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "One SB, the SBS bus."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "MMM from Kranji or maybe next Saturday you can go into my shelter instead of Malaysia. Cannot cannot. Next Saturday I'm going to collect my spectacle. What specs frame did you get?"
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "What is spectacles frame?"
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "Spectacles frame."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "What was the colour and what was?"
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "The shape normal colour colour Col. No colour no colour transition mAh the frame The frame brown. Ah, the frame is brown."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "And then the shape she a bit square rectangle, rectangular, ya."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "OK then, so how much was your new spectacles? About 265 ringgit. It's cheap. Ah, so less than $100,000."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "Sing dollars divided by."
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "33 ah less than that lah less than 100."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "770 to EH No 80 plus."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "And then it's transition lenses, so meaning it will."
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "Cheap. Ah it."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "Will change colour. I mean. Ya it will change under. MMM OK. Have you had non transition spectacles before? Yes."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "When was that?"
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "Long time ago before transitions lenses came out."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "OK, uh, let's see. So what? Maybe we can."
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "OK."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "So ya we had the shelter open house yesterday and then so last year I was, I didn't have a kennel to look after so I was actually managing the whole wing but but this year I had."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "To be inside one of the kennels because we had a dog, A3 legged dog, who was quite selective with people."
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "Do you still want to adopt A dog to your home?"
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "Can I bring Can I bring 1?"
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "Back for your own house. It's OK lah not my house."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "Which which one do you prefer? The brown one that I always show you or the three legged one because ah."
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "Pretty him ah."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "But OK, he's."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "He's OK like he is quite. He's quite used to having three legs now compared to last year, so it's actually becoming stronger also."
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "OK. Can you talk about your CCA in the school time? Oh."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "OK, so last time I was in squash, so, uh, we had trainings two to three times a week and then that was a good period of time because we had a lot of exercise."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "And then what Ccas do you have?"
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "My badminton."
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "I used to play badminton but now cannot lah cannot run already. Also cannot see the bottom."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "How long were you in badminton for?"
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "How long? Ah, since secondary school."
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "Since second so from primary. So when I primary school, no."
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "Do you have any CCA in primary school? Primary school, We don't have CCA, but I participate in the National Day Parade."
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "Which year was that? Eh, but it's SEC 2 at that time. O19 CER 19197019. What was the where was the location? Padang Padang. MMM oh. What year was how old was Singapore 1970? Ah so."
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "That's two years old. Ah, right, 1968, eh? No, no, no, no, no."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "10 years I can't remember lah. I remember 191965 is it independence? 65 S 50 years old. So what did you do for the your National Day performance? Dancing ah?"
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "Dancing."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "What kind of?"
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "Dance."
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "What kind of dance? Ah, something like exercise like that. Any props? We take those."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "Like those bit beaters then? MMM how was that your only national?"
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "When we laugh, ah, really laugh."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "Ya, was that your only National Day performance?"
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "Ya."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "Anything else?"
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "Uh, so."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "How about Ching Chingay parade?"
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "Chingay No, no, I I did not did not participate that time. I think our time no Qing Yuan no, we don't have."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "How many Chingay performances did Joanne go for?"
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "As what did she do for Chingay?"
    },
    {
        "speaker_id": "Guest-2",
        "transcription": "Can't remember leh I."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "Also can't remember, but it's not Ben. It's not a band performance."
    },
    {
        "speaker_id": "Guest-1",
        "transcription": "OK then, so about education, how much did you pay for my tuition fees? Your tuition?"
    },
    {
        "speaker_id": "Guest-1",
        "transcription": ""
    }
]